[
  {
    "bodyPart": "back",
    "equipment": "cable",
    "gifUrl": "https://v2.exercisedb.io/image/ot-caT96JCnb6D",
    "id": "0007",
    "name": "alternate lateral pulldown",
    "target": "lats",
    "time": "30",
    "secondaryMuscles": ["biceps", "rhomboids"],
    "instructions": [
      "Sit on the cable machine with your back straight and feet flat on the ground.",
      "Grasp the handles with an overhand grip, slightly wider than shoulder-width apart.",
      "Lean back slightly and pull the handles towards your chest, squeezing your shoulder blades together.",
      "Pause for a moment at the peak of the movement, then slowly release the handles back to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "body weight",
    "gifUrl": "https://v2.exercisedb.io/image/b7MEzMe8VXhfU2",
    "id": "3293",
    "name": "archer pull up",
    "target": "lats",
    "time": "20",
    "secondaryMuscles": ["biceps", "forearms"],
    "instructions": [
      "Start by hanging from a pull-up bar with an overhand grip, slightly wider than shoulder-width apart.",
      "Engage your core and pull your shoulder blades down and back.",
      "As you pull yourself up, bend one arm and bring your elbow towards your side, while keeping the other arm straight.",
      "Continue pulling until your chin is above the bar and your bent arm is fully flexed.",
      "Lower yourself back down with control, straightening the bent arm and repeating the movement on the other side.",
      "Alternate sides with each repetition."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "leverage machine",
    "gifUrl": "https://v2.exercisedb.io/image/z7U85O-Z35Cj8t",
    "id": "0015",
    "name": "assisted parallel close grip pull-up",
    "target": "lats",
    "time": "15",
    "secondaryMuscles": ["biceps", "forearms"],
    "instructions": [
      "Adjust the machine to your desired weight and height.",
      "Place your hands on the parallel bars with a close grip, palms facing each other.",
      "Hang from the bars with your arms fully extended and your feet off the ground.",
      "Engage your back muscles and pull your body up towards the bars, keeping your elbows close to your body.",
      "Continue pulling until your chin is above the bars.",
      "Pause for a moment at the top, then slowly lower your body back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "leverage machine",
    "gifUrl": "https://v2.exercisedb.io/image/WuyRuv2xtL6Qsz",
    "id": "0017",
    "name": "assisted pull-up",
    "target": "lats",
    "time": "35",
    "secondaryMuscles": ["biceps", "forearms"],
    "instructions": [
      "Adjust the machine to your desired weight and height settings.",
      "Grasp the handles with an overhand grip, slightly wider than shoulder-width apart.",
      "Hang with your arms fully extended and your feet off the ground.",
      "Engage your back muscles and pull your body up towards the handles, keeping your elbows close to your body.",
      "Continue pulling until your chin is above the handles.",
      "Pause for a moment at the top, then slowly lower your body back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "leverage machine",
    "gifUrl": "https://v2.exercisedb.io/image/4-7xbJU-GuEmvq",
    "id": "1431",
    "name": "assisted standing chin-up",
    "target": "lats",
    "time": "10",
    "secondaryMuscles": ["biceps", "forearms"],
    "instructions": [
      "Adjust the machine to your desired assistance level.",
      "Stand on the foot platform and grip the handles with an overhand grip, slightly wider than shoulder-width apart.",
      "Keep your chest up and shoulders back, engage your core, and slightly bend your knees.",
      "Pull your body up by flexing your elbows and driving your elbows down towards your sides.",
      "Continue pulling until your chin is above the bar.",
      "Pause for a moment at the top, then slowly lower your body back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "leverage machine",
    "gifUrl": "https://v2.exercisedb.io/image/nViR6KpT50qVgT",
    "id": "1432",
    "name": "assisted standing pull-up",
    "target": "lats",
    "time": "25",
    "secondaryMuscles": ["biceps", "forearms"],
    "instructions": [
      "Adjust the machine to your desired weight and height settings.",
      "Stand facing the machine with your feet shoulder-width apart.",
      "Grasp the handles with an overhand grip, slightly wider than shoulder-width apart.",
      "Engage your lats and biceps, and pull yourself up towards the handles.",
      "Pause for a moment at the top, squeezing your back muscles.",
      "Slowly lower yourself back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "stability ball",
    "gifUrl": "https://v2.exercisedb.io/image/5nT4FFTzfuGpfH",
    "id": "1314",
    "name": "back extension on exercise ball",
    "target": "spine",
    "time": "15",
    "secondaryMuscles": ["glutes", "hamstrings"],
    "instructions": [
      "Place the stability ball on the ground and lie face down on top of it, with your hips resting on the ball and your feet against a wall or other stable surface.",
      "Position your hands behind your head or crossed over your chest.",
      "Engage your core and slowly lift your upper body off the ball, extending your back until your body forms a straight line from your head to your heels.",
      "Pause for a moment at the top, then slowly lower your upper body back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "body weight",
    "gifUrl": "https://v2.exercisedb.io/image/ksbSx1yoTxOdhj",
    "id": "3297",
    "name": "back lever",
    "target": "upper back",
    "time": "5",
    "secondaryMuscles": ["biceps", "forearms", "core"],
    "instructions": [
      "Start by hanging from a pull-up bar with an overhand grip, hands slightly wider than shoulder-width apart.",
      "Engage your core and pull your shoulder blades down and back.",
      "Bend your knees and tuck them towards your chest.",
      "Slowly lift your legs up, keeping them straight, until your body is parallel to the ground.",
      "Hold this position for a few seconds, then slowly lower your legs back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "body weight",
    "gifUrl": "https://v2.exercisedb.io/image/eVpELRPA5mz5k0",
    "id": "1405",
    "name": "back pec stretch",
    "target": "lats",
    "time": "20",
    "secondaryMuscles": ["shoulders", "chest"],
    "instructions": [
      "Stand tall with your feet shoulder-width apart.",
      "Extend your arms straight out in front of you, parallel to the ground.",
      "Cross your arms in front of your body, with your right arm over your left arm.",
      "Interlock your fingers and rotate your palms away from your body.",
      "Slowly raise your arms up and away from your body, feeling a stretch in your back and chest.",
      "Hold the stretch for 15-30 seconds, then release.",
      "Repeat on the opposite side."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "band",
    "gifUrl": "https://v2.exercisedb.io/image/u8-K3LGxrQ6uqI",
    "id": "0970",
    "name": "band assisted pull-up",
    "target": "lats",
    "time": "17",
    "secondaryMuscles": ["biceps", "forearms"],
    "instructions": [
      "Attach the band to a pull-up bar or sturdy anchor point.",
      "Step onto the band and grip the bar with your palms facing away from you, hands slightly wider than shoulder-width apart.",
      "Hang with your arms fully extended, keeping your core engaged and your shoulders down and back.",
      "Pull your body up towards the bar by squeezing your shoulder blades together and driving your elbows down towards your hips.",
      "Continue pulling until your chin is above the bar, then slowly lower yourself back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "band",
    "gifUrl": "https://v2.exercisedb.io/image/8lnHvBXDTU-R80",
    "id": "0974",
    "name": "band close-grip pulldown",
    "target": "lats",
    "time": "12",
    "secondaryMuscles": ["biceps", "forearms"],
    "instructions": [
      "Attach the band to a high anchor point, such as a pull-up bar or sturdy beam.",
      "Stand facing the anchor point and grab the band with an underhand grip, hands shoulder-width apart.",
      "Step back to create tension in the band, keeping your feet hip-width apart.",
      "Engage your core and keep your back straight as you pull the band down towards your chest, squeezing your shoulder blades together.",
      "Pause for a moment at the bottom of the movement, then slowly release the band back to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "band",
    "gifUrl": "https://v2.exercisedb.io/image/VeZKQR-xYm9xR7",
    "id": "3117",
    "name": "band fixed back close grip pulldown",
    "target": "lats",
    "time": "23",
    "secondaryMuscles": ["biceps", "forearms"],
    "instructions": [
      "Attach the band to a fixed point above you, such as a pull-up bar or sturdy beam.",
      "Sit down on a bench or chair facing the band, with your feet flat on the ground and your knees bent.",
      "Grasp the band with a close grip, palms facing towards you.",
      "Keep your back straight and engage your core.",
      "Pull the band down towards your chest, squeezing your shoulder blades together.",
      "Pause for a moment at the bottom of the movement, feeling the contraction in your lats.",
      "Slowly release the band back to the starting position, maintaining control throughout the movement.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "band",
    "gifUrl": "https://v2.exercisedb.io/image/94vI3TMxQ4fXfO",
    "id": "3116",
    "name": "band fixed back underhand pulldown",
    "target": "lats",
    "time": "19",
    "secondaryMuscles": ["biceps", "rhomboids", "rear deltoids"],
    "instructions": [
      "Attach the band to a sturdy anchor point above your head.",
      "Stand facing the anchor point with your feet shoulder-width apart.",
      "Grasp the band with an underhand grip, hands slightly wider than shoulder-width apart.",
      "Step back to create tension in the band, keeping your arms fully extended.",
      "Engage your core and squeeze your shoulder blades together.",
      "Pull the band down towards your chest, leading with your elbows.",
      "Pause for a moment at the bottom of the movement, feeling the contraction in your lats.",
      "Slowly release the tension in the band and return to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "band",
    "gifUrl": "https://v2.exercisedb.io/image/Wt2RX7Mo-55Exd",
    "id": "0983",
    "name": "band kneeling one arm pulldown",
    "target": "lats",
    "time": "9",
    "secondaryMuscles": ["biceps", "rhomboids"],
    "instructions": [
      "Attach the band to a sturdy anchor point above your head.",
      "Kneel down and hold the band with one hand, palm facing down.",
      "Extend your arm fully overhead, keeping your elbow slightly bent.",
      "Engage your lat muscles and pull the band down towards your side, bringing your elbow towards your ribcage.",
      "Pause for a moment at the bottom, then slowly release the tension and return to the starting position.",
      "Repeat for the desired number of repetitions, then switch sides."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "band",
    "gifUrl": "https://v2.exercisedb.io/image/-uVaXpovR9EDL5",
    "id": "0988",
    "name": "band one arm standing low row",
    "target": "upper back",
    "time": "27",
    "secondaryMuscles": ["biceps", "shoulders"],
    "instructions": [
      "Attach the band to a stable anchor point at waist height.",
      "Stand facing the anchor point with your feet shoulder-width apart.",
      "Hold the band with one hand, palm facing inward, and step back to create tension in the band.",
      "Bend your knees slightly and hinge forward at the hips, keeping your back straight.",
      "Pull the band towards your waist, squeezing your shoulder blades together.",
      "Pause for a moment at the top of the movement, then slowly release the band back to the starting position.",
      "Repeat for the desired number of repetitions, then switch sides."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "band",
    "gifUrl": "https://v2.exercisedb.io/image/C9o46DFemDzCxd",
    "id": "0990",
    "name": "band one arm twisting seated row",
    "target": "upper back",
    "time": "16",
    "secondaryMuscles": ["biceps", "shoulders"],
    "instructions": [
      "Sit on a bench or chair with your feet flat on the ground and your back straight.",
      "Hold the band with one hand and extend your arm fully in front of you.",
      "Keeping your back straight, pull the band towards your body by bending your elbow and squeezing your shoulder blades together.",
      "At the same time, twist your torso towards the side of the pulling arm.",
      "Pause for a moment at the top, then slowly release the tension in the band and return to the starting position.",
      "Repeat for the desired number of repetitions, then switch to the other arm."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "band",
    "gifUrl": "https://v2.exercisedb.io/image/9BD-fA3V5TOiUS",
    "id": "1018",
    "name": "band shrug",
    "target": "traps",
    "time": "18",
    "secondaryMuscles": ["shoulders"],
    "instructions": [
      "Stand with your feet shoulder-width apart and place the band under your feet, holding the ends with your hands.",
      "Keep your arms straight and relaxed, and let the band hang in front of your thighs.",
      "Engage your traps by shrugging your shoulders upward, lifting the band as high as possible.",
      "Hold the contraction for a moment, then slowly lower your shoulders back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "band",
    "gifUrl": "https://v2.exercisedb.io/image/AewhXFXl3eSgxd",
    "id": "1010",
    "name": "band straight leg deadlift",
    "target": "spine",
    "time": "22",
    "secondaryMuscles": ["hamstrings", "glutes"],
    "instructions": [
      "Stand with your feet shoulder-width apart and place the band around your feet.",
      "Hold the band with both hands, palms facing your body, and keep your arms straight.",
      "Engage your core and maintain a slight bend in your knees.",
      "Slowly hinge forward at your hips, keeping your back straight and chest lifted.",
      "Lower the band towards the ground while keeping your legs straight.",
      "Pause for a moment at the bottom, then squeeze your glutes and hamstrings to return to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "band",
    "gifUrl": "https://v2.exercisedb.io/image/FgF5D10wxwhPmz",
    "id": "1013",
    "name": "band underhand pulldown",
    "target": "lats",
    "time": "20",
    "secondaryMuscles": ["biceps", "forearms"],
    "instructions": [
      "Attach the band to a high anchor point, such as a pull-up bar or sturdy beam.",
      "Stand facing the anchor point with your feet shoulder-width apart.",
      "Grasp the band with an underhand grip, hands slightly wider than shoulder-width apart.",
      "Extend your arms fully overhead, keeping your elbows slightly bent.",
      "Engage your lats and pull the band down towards your chest, squeezing your shoulder blades together.",
      "Pause for a moment at the bottom of the movement, then slowly release the tension and return to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "barbell",
    "gifUrl": "https://v2.exercisedb.io/image/5dUUuX7FMCUaY9",
    "id": "1316",
    "name": "barbell bent arm pullover",
    "target": "lats",
    "time": "15",
    "secondaryMuscles": ["triceps", "chest"],
    "instructions": [
      "Lie flat on a bench with your head at one end and your feet on the floor.",
      "Hold a barbell with a shoulder-width grip and extend your arms straight above your chest.",
      "Lower the barbell behind your head while keeping your arms slightly bent.",
      "Pause for a moment, then raise the barbell back to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  }
]
